; ModuleID = 'hotspot_openmp.cpp'
source_filename = "hotspot_openmp.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ident_t = type { i32, i32, i32, i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.timeval = type { i64, i64 }

@num_omp_threads = dso_local local_unnamed_addr global i32 0, align 4, !dbg !0
@.str = private unnamed_addr constant [23 x i8] c";unknown;unknown;0;0;;\00", align 1
@0 = private unnamed_addr constant %struct.ident_t { i32 0, i32 514, i32 0, i32 0, i8* getelementptr inbounds ([23 x i8], [23 x i8]* @.str, i32 0, i32 0) }, align 8
@1 = private unnamed_addr constant [44 x i8] c";hotspot_openmp.cpp;single_iteration;69;5;;\00", align 1
@2 = private unnamed_addr constant [46 x i8] c";hotspot_openmp.cpp;single_iteration;69;151;;\00", align 1
@3 = private unnamed_addr constant %struct.ident_t { i32 0, i32 2, i32 0, i32 0, i8* getelementptr inbounds ([23 x i8], [23 x i8]* @.str, i32 0, i32 0) }, align 8
@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "num_omp_threads", scope: !2, file: !3, line: 48, type: !10, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !103, imports: !113, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "hotspot_openmp.cpp", directory: "/home/andrew/class/clinic-hardware-accelerator/rodinia_3.1/openmp/hotspot")
!4 = !{}
!5 = !{!6, !22, !26, !88, !91, !94, !95, !97, !98, !10, !102}
!6 = !DISubprogram(name: "gettimeofday", scope: !7, file: !7, line: 66, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "/usr/include/sys/time.h", directory: "")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11, !21}
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !13, line: 8, size: 128, flags: DIFlagTypePassByValue, elements: !14, identifier: "_ZTS7timeval")
!13 = !DIFile(filename: "/usr/include/bits/types/struct_timeval.h", directory: "")
!14 = !{!15, !19}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !12, file: !13, line: 10, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !17, line: 160, baseType: !18)
!17 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!18 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !12, file: !13, line: 11, baseType: !20, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !17, line: 162, baseType: !18)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DISubprogram(name: "omp_set_num_threads", scope: !23, file: !23, line: 57, type: !24, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!23 = !DIFile(filename: "/usr/include/omp.h", directory: "")
!24 = !DISubroutineType(types: !25)
!25 = !{null, !10}
!26 = !DISubprogram(name: "fputs", scope: !27, file: !27, line: 631, type: !28, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!27 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!28 = !DISubroutineType(types: !29)
!29 = !{!10, !30, !33}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !35, line: 49, size: 1728, flags: DIFlagTypePassByValue, elements: !36, identifier: "_ZTS8_IO_FILE")
!35 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!36 = !{!37, !38, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !53, !54, !55, !56, !58, !60, !62, !66, !69, !71, !74, !77, !78, !79, !83, !84}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !34, file: !35, line: 51, baseType: !10, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !34, file: !35, line: 54, baseType: !39, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !34, file: !35, line: 55, baseType: !39, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !34, file: !35, line: 56, baseType: !39, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !34, file: !35, line: 57, baseType: !39, size: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !34, file: !35, line: 58, baseType: !39, size: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !34, file: !35, line: 59, baseType: !39, size: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !34, file: !35, line: 60, baseType: !39, size: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !34, file: !35, line: 61, baseType: !39, size: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !34, file: !35, line: 64, baseType: !39, size: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !34, file: !35, line: 65, baseType: !39, size: 64, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !34, file: !35, line: 66, baseType: !39, size: 64, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !34, file: !35, line: 68, baseType: !51, size: 64, offset: 768)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !35, line: 36, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !34, file: !35, line: 70, baseType: !33, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !34, file: !35, line: 72, baseType: !10, size: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !34, file: !35, line: 73, baseType: !10, size: 32, offset: 928)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !34, file: !35, line: 74, baseType: !57, size: 64, offset: 960)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !17, line: 152, baseType: !18)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !34, file: !35, line: 77, baseType: !59, size: 16, offset: 1024)
!59 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !34, file: !35, line: 78, baseType: !61, size: 8, offset: 1040)
!61 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !34, file: !35, line: 79, baseType: !63, size: 8, offset: 1048)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 1)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !34, file: !35, line: 81, baseType: !67, size: 64, offset: 1088)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !35, line: 43, baseType: null)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !34, file: !35, line: 89, baseType: !70, size: 64, offset: 1152)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !17, line: 153, baseType: !18)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !34, file: !35, line: 91, baseType: !72, size: 64, offset: 1216)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !35, line: 37, flags: DIFlagFwdDecl, identifier: "_ZTS11_IO_codecvt")
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !34, file: !35, line: 92, baseType: !75, size: 64, offset: 1280)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !35, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTS13_IO_wide_data")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !34, file: !35, line: 93, baseType: !33, size: 64, offset: 1344)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !34, file: !35, line: 94, baseType: !21, size: 64, offset: 1408)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !34, file: !35, line: 95, baseType: !80, size: 64, offset: 1472)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !81, line: 46, baseType: !82)
!81 = !DIFile(filename: "/usr/lib/clang/10.0.1/include/stddef.h", directory: "")
!82 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !34, file: !35, line: 96, baseType: !10, size: 32, offset: 1536)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !34, file: !35, line: 98, baseType: !85, size: 160, offset: 1568)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 20)
!88 = !DISubprogram(name: "fclose", scope: !27, file: !27, line: 213, type: !89, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!89 = !DISubroutineType(types: !90)
!90 = !{!10, !33}
!91 = !DISubprogram(name: "fgets", scope: !27, file: !27, line: 568, type: !92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!92 = !DISubroutineType(types: !93)
!93 = !{!39, !39, !10, !33}
!94 = !DISubprogram(name: "feof", scope: !27, file: !27, line: 764, type: !89, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLOAT", file: !3, line: 34, baseType: !97)
!97 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!98 = !DISubprogram(name: "free", scope: !99, file: !99, line: 565, type: !100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!99 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!100 = !DISubroutineType(types: !101)
!101 = !{null, !21}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!103 = !{!104, !107, !109, !111, !0}
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression(DW_OP_constu, 1117782016, DW_OP_stack_value))
!105 = distinct !DIGlobalVariable(name: "amb_temp", scope: !2, file: !3, line: 46, type: !106, isLocal: true, isDefinition: true)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression(DW_OP_constu, 1015222895, DW_OP_stack_value))
!108 = distinct !DIGlobalVariable(name: "chip_height", scope: !2, file: !3, line: 38, type: !106, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression(DW_OP_constu, 1015222895, DW_OP_stack_value))
!110 = distinct !DIGlobalVariable(name: "chip_width", scope: !2, file: !3, line: 39, type: !106, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression(DW_OP_constu, 973279855, DW_OP_stack_value))
!112 = distinct !DIGlobalVariable(name: "t_chip", scope: !2, file: !3, line: 37, type: !106, isLocal: true, isDefinition: true)
!113 = !{!114, !120, !124, !130, !134, !139, !141, !147, !153, !157, !168, !172, !176, !178, !180, !184, !188, !192, !196, !200, !208, !212, !216, !218, !222, !226, !231, !236, !240, !244, !246, !254, !258, !266, !268, !272, !276, !280, !284, !289, !293, !298, !299, !300, !301, !303, !304, !305, !306, !307, !308, !309, !311, !312, !313, !314, !315, !316, !317, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346}
!114 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !116, file: !119, line: 52)
!115 = !DINamespace(name: "std", scope: null)
!116 = !DISubprogram(name: "abs", scope: !99, file: !99, line: 840, type: !117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!117 = !DISubroutineType(types: !118)
!118 = !{!10, !10}
!119 = !DIFile(filename: "/usr/bin/../lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/std_abs.h", directory: "")
!120 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !121, file: !123, line: 127)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !99, line: 62, baseType: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!123 = !DIFile(filename: "/usr/bin/../lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/cstdlib", directory: "")
!124 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !125, file: !123, line: 128)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !99, line: 70, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !127, identifier: "_ZTS6ldiv_t")
!127 = !{!128, !129}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !126, file: !99, line: 68, baseType: !18, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !126, file: !99, line: 69, baseType: !18, size: 64, offset: 64)
!130 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !131, file: !123, line: 130)
!131 = !DISubprogram(name: "abort", scope: !99, file: !99, line: 591, type: !132, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!132 = !DISubroutineType(types: !133)
!133 = !{null}
!134 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !135, file: !123, line: 134)
!135 = !DISubprogram(name: "atexit", scope: !99, file: !99, line: 595, type: !136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!136 = !DISubroutineType(types: !137)
!137 = !{!10, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!139 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !140, file: !123, line: 137)
!140 = !DISubprogram(name: "at_quick_exit", scope: !99, file: !99, line: 600, type: !136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!141 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !142, file: !123, line: 140)
!142 = !DISubprogram(name: "atof", scope: !143, file: !143, line: 25, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!143 = !DIFile(filename: "/usr/include/bits/stdlib-float.h", directory: "")
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !30}
!146 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!147 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !148, file: !123, line: 141)
!148 = distinct !DISubprogram(name: "atoi", scope: !99, file: !99, line: 361, type: !149, scopeLine: 362, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !151)
!149 = !DISubroutineType(types: !150)
!150 = !{!10, !30}
!151 = !{!152}
!152 = !DILocalVariable(name: "__nptr", arg: 1, scope: !148, file: !99, line: 361, type: !30)
!153 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !154, file: !123, line: 142)
!154 = !DISubprogram(name: "atol", scope: !99, file: !99, line: 366, type: !155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!155 = !DISubroutineType(types: !156)
!156 = !{!18, !30}
!157 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !158, file: !123, line: 143)
!158 = !DISubprogram(name: "bsearch", scope: !159, file: !159, line: 20, type: !160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!159 = !DIFile(filename: "/usr/include/bits/stdlib-bsearch.h", directory: "")
!160 = !DISubroutineType(types: !161)
!161 = !{!21, !162, !162, !80, !80, !164}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !99, line: 808, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!10, !162, !162}
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !169, file: !123, line: 144)
!169 = !DISubprogram(name: "calloc", scope: !99, file: !99, line: 542, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!170 = !DISubroutineType(types: !171)
!171 = !{!21, !80, !80}
!172 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !173, file: !123, line: 145)
!173 = !DISubprogram(name: "div", scope: !99, file: !99, line: 852, type: !174, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!174 = !DISubroutineType(types: !175)
!175 = !{!121, !10, !10}
!176 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !177, file: !123, line: 146)
!177 = !DISubprogram(name: "exit", scope: !99, file: !99, line: 617, type: !24, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !179, file: !123, line: 147)
!179 = !DISubprogram(name: "free", scope: !99, file: !99, line: 565, type: !100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!180 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !181, file: !123, line: 148)
!181 = !DISubprogram(name: "getenv", scope: !99, file: !99, line: 634, type: !182, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!182 = !DISubroutineType(types: !183)
!183 = !{!39, !30}
!184 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !185, file: !123, line: 149)
!185 = !DISubprogram(name: "labs", scope: !99, file: !99, line: 841, type: !186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!186 = !DISubroutineType(types: !187)
!187 = !{!18, !18}
!188 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !189, file: !123, line: 150)
!189 = !DISubprogram(name: "ldiv", scope: !99, file: !99, line: 854, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!190 = !DISubroutineType(types: !191)
!191 = !{!125, !18, !18}
!192 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !193, file: !123, line: 151)
!193 = !DISubprogram(name: "malloc", scope: !99, file: !99, line: 539, type: !194, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!194 = !DISubroutineType(types: !195)
!195 = !{!21, !80}
!196 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !197, file: !123, line: 153)
!197 = !DISubprogram(name: "mblen", scope: !99, file: !99, line: 922, type: !198, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!198 = !DISubroutineType(types: !199)
!199 = !{!10, !30, !80}
!200 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !201, file: !123, line: 154)
!201 = !DISubprogram(name: "mbstowcs", scope: !99, file: !99, line: 933, type: !202, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!202 = !DISubroutineType(types: !203)
!203 = !{!80, !204, !207, !80}
!204 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !30)
!208 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !209, file: !123, line: 155)
!209 = !DISubprogram(name: "mbtowc", scope: !99, file: !99, line: 925, type: !210, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!210 = !DISubroutineType(types: !211)
!211 = !{!10, !204, !207, !80}
!212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !213, file: !123, line: 157)
!213 = !DISubprogram(name: "qsort", scope: !99, file: !99, line: 830, type: !214, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !21, !80, !80, !164}
!216 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !217, file: !123, line: 160)
!217 = !DISubprogram(name: "quick_exit", scope: !99, file: !99, line: 623, type: !24, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!218 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !219, file: !123, line: 163)
!219 = !DISubprogram(name: "rand", scope: !99, file: !99, line: 453, type: !220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!220 = !DISubroutineType(types: !221)
!221 = !{!10}
!222 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !223, file: !123, line: 164)
!223 = !DISubprogram(name: "realloc", scope: !99, file: !99, line: 550, type: !224, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!224 = !DISubroutineType(types: !225)
!225 = !{!21, !21, !80}
!226 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !227, file: !123, line: 165)
!227 = !DISubprogram(name: "srand", scope: !99, file: !99, line: 455, type: !228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !230}
!230 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!231 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !232, file: !123, line: 166)
!232 = !DISubprogram(name: "strtod", scope: !99, file: !99, line: 117, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DISubroutineType(types: !234)
!234 = !{!146, !207, !235}
!235 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !102)
!236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !237, file: !123, line: 167)
!237 = !DISubprogram(name: "strtol", scope: !99, file: !99, line: 176, type: !238, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!238 = !DISubroutineType(types: !239)
!239 = !{!18, !207, !235, !10}
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !241, file: !123, line: 168)
!241 = !DISubprogram(name: "strtoul", scope: !99, file: !99, line: 180, type: !242, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!242 = !DISubroutineType(types: !243)
!243 = !{!82, !207, !235, !10}
!244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !245, file: !123, line: 169)
!245 = !DISubprogram(name: "system", scope: !99, file: !99, line: 784, type: !149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !247, file: !123, line: 171)
!247 = !DISubprogram(name: "wcstombs", scope: !99, file: !99, line: 937, type: !248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!248 = !DISubroutineType(types: !249)
!249 = !{!80, !250, !251, !80}
!250 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!251 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !255, file: !123, line: 172)
!255 = !DISubprogram(name: "wctomb", scope: !99, file: !99, line: 929, type: !256, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!256 = !DISubroutineType(types: !257)
!257 = !{!10, !39, !206}
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !259, entity: !260, file: !123, line: 200)
!259 = !DINamespace(name: "__gnu_cxx", scope: null)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !99, line: 80, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !262, identifier: "_ZTS7lldiv_t")
!262 = !{!263, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !261, file: !99, line: 78, baseType: !264, size: 64)
!264 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !261, file: !99, line: 79, baseType: !264, size: 64, offset: 64)
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !259, entity: !267, file: !123, line: 206)
!267 = !DISubprogram(name: "_Exit", scope: !99, file: !99, line: 629, type: !24, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !259, entity: !269, file: !123, line: 210)
!269 = !DISubprogram(name: "llabs", scope: !99, file: !99, line: 844, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!270 = !DISubroutineType(types: !271)
!271 = !{!264, !264}
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !259, entity: !273, file: !123, line: 216)
!273 = !DISubprogram(name: "lldiv", scope: !99, file: !99, line: 858, type: !274, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!274 = !DISubroutineType(types: !275)
!275 = !{!260, !264, !264}
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !259, entity: !277, file: !123, line: 227)
!277 = !DISubprogram(name: "atoll", scope: !99, file: !99, line: 373, type: !278, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!278 = !DISubroutineType(types: !279)
!279 = !{!264, !30}
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !259, entity: !281, file: !123, line: 228)
!281 = !DISubprogram(name: "strtoll", scope: !99, file: !99, line: 200, type: !282, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!282 = !DISubroutineType(types: !283)
!283 = !{!264, !207, !235, !10}
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !259, entity: !285, file: !123, line: 229)
!285 = !DISubprogram(name: "strtoull", scope: !99, file: !99, line: 205, type: !286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!286 = !DISubroutineType(types: !287)
!287 = !{!288, !207, !235, !10}
!288 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !259, entity: !290, file: !123, line: 231)
!290 = !DISubprogram(name: "strtof", scope: !99, file: !99, line: 123, type: !291, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!291 = !DISubroutineType(types: !292)
!292 = !{!97, !207, !235}
!293 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !259, entity: !294, file: !123, line: 232)
!294 = !DISubprogram(name: "strtold", scope: !99, file: !99, line: 126, type: !295, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!295 = !DISubroutineType(types: !296)
!296 = !{!297, !207, !235}
!297 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!298 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !260, file: !123, line: 240)
!299 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !267, file: !123, line: 242)
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !269, file: !123, line: 244)
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !302, file: !123, line: 245)
!302 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !259, file: !123, line: 213, type: !274, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !273, file: !123, line: 246)
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !277, file: !123, line: 248)
!305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !290, file: !123, line: 249)
!306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !281, file: !123, line: 250)
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !285, file: !123, line: 251)
!308 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !294, file: !123, line: 252)
