; ModuleID = '3D.c'
source_filename = "3D.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ident_t = type { i32, i32, i32, i32, i8* }
%struct.timeval = type { i64, i64 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [11 x i8] c"Error: %s\0A\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [20 x i8] c"Error reading file\0A\00", align 1
@.str.4 = private unnamed_addr constant [25 x i8] c"not enough lines in file\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"%f\00", align 1
@.str.6 = private unnamed_addr constant [20 x i8] c"invalid file format\00", align 1
@.str.7 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.9 = private unnamed_addr constant [7 x i8] c"%d\09%g\0A\00", align 1
@amb_temp = dso_local local_unnamed_addr global float 8.000000e+01, align 4, !dbg !0
@.str.10 = private unnamed_addr constant [23 x i8] c";unknown;unknown;0;0;;\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "amb_temp", scope: !2, file: !3, line: 23, type: !79, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !101, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "3D.c", directory: "/home/andrew/class/clinic-hardware-accelerator/rodinia_3.1/openmp/hotspot3D")
!4 = !{}
!5 = !{!6, !60, !70, !73, !74, !79, !80, !83, !84, !96, !12, !100}
!6 = !DISubprogram(name: "fgets", scope: !7, file: !7, line: 568, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10, !12, !13}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !15, line: 49, size: 1728, elements: !16)
!15 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !32, !33, !34, !35, !39, !41, !43, !47, !50, !52, !55, !58, !59, !61, !65, !66}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !14, file: !15, line: 51, baseType: !12, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !14, file: !15, line: 54, baseType: !10, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !14, file: !15, line: 55, baseType: !10, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !14, file: !15, line: 56, baseType: !10, size: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !14, file: !15, line: 57, baseType: !10, size: 64, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !14, file: !15, line: 58, baseType: !10, size: 64, offset: 320)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !14, file: !15, line: 59, baseType: !10, size: 64, offset: 384)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !14, file: !15, line: 60, baseType: !10, size: 64, offset: 448)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !14, file: !15, line: 61, baseType: !10, size: 64, offset: 512)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !14, file: !15, line: 64, baseType: !10, size: 64, offset: 576)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !14, file: !15, line: 65, baseType: !10, size: 64, offset: 640)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !14, file: !15, line: 66, baseType: !10, size: 64, offset: 704)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !14, file: !15, line: 68, baseType: !30, size: 64, offset: 768)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !15, line: 36, flags: DIFlagFwdDecl)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !14, file: !15, line: 70, baseType: !13, size: 64, offset: 832)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !14, file: !15, line: 72, baseType: !12, size: 32, offset: 896)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !14, file: !15, line: 73, baseType: !12, size: 32, offset: 928)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !14, file: !15, line: 74, baseType: !36, size: 64, offset: 960)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !37, line: 152, baseType: !38)
!37 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!38 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !14, file: !15, line: 77, baseType: !40, size: 16, offset: 1024)
!40 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !14, file: !15, line: 78, baseType: !42, size: 8, offset: 1040)
!42 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !14, file: !15, line: 79, baseType: !44, size: 8, offset: 1048)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 1)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !14, file: !15, line: 81, baseType: !48, size: 64, offset: 1088)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !15, line: 43, baseType: null)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !14, file: !15, line: 89, baseType: !51, size: 64, offset: 1152)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !37, line: 153, baseType: !38)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !14, file: !15, line: 91, baseType: !53, size: 64, offset: 1216)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !15, line: 37, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !14, file: !15, line: 92, baseType: !56, size: 64, offset: 1280)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !15, line: 38, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !14, file: !15, line: 93, baseType: !13, size: 64, offset: 1344)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !14, file: !15, line: 94, baseType: !60, size: 64, offset: 1408)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !14, file: !15, line: 95, baseType: !62, size: 64, offset: 1472)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !63, line: 46, baseType: !64)
!63 = !DIFile(filename: "/usr/lib/clang/10.0.1/include/stddef.h", directory: "")
!64 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !14, file: !15, line: 96, baseType: !12, size: 32, offset: 1536)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !14, file: !15, line: 98, baseType: !67, size: 160, offset: 1568)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 20)
!70 = !DISubprogram(name: "feof", scope: !7, file: !7, line: 764, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!71 = !DISubroutineType(types: !72)
!72 = !{!12, !13}
!73 = !DISubprogram(name: "fclose", scope: !7, file: !7, line: 213, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!74 = !DISubprogram(name: "fputs", scope: !7, file: !7, line: 631, type: !75, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!75 = !DISubroutineType(types: !76)
!76 = !{!12, !77, !13}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!79 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!80 = !DISubprogram(name: "omp_get_num_threads", scope: !3, file: !3, line: 157, type: !81, flags: DIFlagArtificial, spFlags: DISPFlagOptimized, retainedNodes: !4)
!81 = !DISubroutineType(types: !82)
!82 = !{!12, null}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!84 = !DISubprogram(name: "gettimeofday", scope: !85, file: !85, line: 66, type: !86, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!85 = !DIFile(filename: "/usr/include/sys/time.h", directory: "")
!86 = !DISubroutineType(types: !87)
!87 = !{!12, !88, !60}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !90, line: 8, size: 128, elements: !91)
!90 = !DIFile(filename: "/usr/include/bits/types/struct_timeval.h", directory: "")
!91 = !{!92, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !89, file: !90, line: 10, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !37, line: 160, baseType: !38)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !89, file: !90, line: 11, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !37, line: 162, baseType: !38)
!96 = !DISubprogram(name: "free", scope: !97, file: !97, line: 565, type: !98, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!97 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!98 = !DISubroutineType(types: !99)
!99 = !{null, !60}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!101 = !{!102, !104, !106, !0}
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "t_chip", scope: !2, file: !3, line: 20, type: !79, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "chip_height", scope: !2, file: !3, line: 21, type: !79, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "chip_width", scope: !2, file: !3, line: 21, type: !79, isLocal: false, isDefinition: true)
!108 = !{i32 7, !"Dwarf Version", i32 4}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{i32 1, !"wchar_size", i32 4}
!111 = !{i32 7, !"PIC Level", i32 2}
!112 = !{i32 7, !"PIE Level", i32 2}
!113 = !{!"clang version 10.0.1 "}
!114 = distinct !DISubprogram(name: "fatal", scope: !3, file: !3, line: 25, type: !115, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !117)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !10}
!117 = !{!118}
!118 = !DILocalVariable(name: "s", arg: 1, scope: !114, file: !3, line: 25, type: !10)
!119 = !DILocation(line: 0, scope: !114)
!120 = !DILocation(line: 27, column: 13, scope: !114)
!121 = !{!122, !122, i64 0}
!122 = !{!"any pointer", !123, i64 0}
!123 = !{!"omnipotent char", !124, i64 0}
!124 = !{!"Simple C/C++ TBAA"}
!125 = !DILocation(line: 27, column: 5, scope: !114)
!126 = !DILocation(line: 28, column: 1, scope: !114)
!127 = distinct !DISubprogram(name: "readinput", scope: !3, file: !3, line: 30, type: !128, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !130)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !83, !12, !12, !12, !10}
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !143, !147}
!131 = !DILocalVariable(name: "vect", arg: 1, scope: !127, file: !3, line: 30, type: !83)
!132 = !DILocalVariable(name: "grid_rows", arg: 2, scope: !127, file: !3, line: 30, type: !12)
!133 = !DILocalVariable(name: "grid_cols", arg: 3, scope: !127, file: !3, line: 30, type: !12)
!134 = !DILocalVariable(name: "layers", arg: 4, scope: !127, file: !3, line: 30, type: !12)
!135 = !DILocalVariable(name: "file", arg: 5, scope: !127, file: !3, line: 30, type: !10)
!136 = !DILocalVariable(name: "i", scope: !127, file: !3, line: 31, type: !12)
!137 = !DILocalVariable(name: "j", scope: !127, file: !3, line: 31, type: !12)
!138 = !DILocalVariable(name: "k", scope: !127, file: !3, line: 31, type: !12)
!139 = !DILocalVariable(name: "fp", scope: !127, file: !3, line: 32, type: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !142, line: 7, baseType: !14)
!142 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!143 = !DILocalVariable(name: "str", scope: !127, file: !3, line: 33, type: !144)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 256)
!147 = !DILocalVariable(name: "val", scope: !127, file: !3, line: 34, type: !79)
!148 = !DILocation(line: 0, scope: !127)
!149 = !DILocation(line: 33, column: 5, scope: !127)
