; ModuleID = 'main.c'
source_filename = "main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ident_t = type { i32, i32, i32, i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.timeval = type { i64, i64 }

@.str = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"P2\0A\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"%d %d\0A\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1
@.str.5 = private unnamed_addr constant [4 x i8] c"%d \00", align 1
@.str.7 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.9 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.11 = private unnamed_addr constant [29 x i8] c"../../../data/srad/image.pgm\00", align 1
@.str.12 = private unnamed_addr constant [23 x i8] c";unknown;unknown;0;0;;\00", align 1
@0 = private unnamed_addr constant %struct.ident_t { i32 0, i32 514, i32 0, i32 0, i8* getelementptr inbounds ([23 x i8], [23 x i8]* @.str.12, i32 0, i32 0) }, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "main.c", directory: "/mnt/d/RISC-V-PROJECT/rowan-riscv-rodinia-llvm/src/openmp/srad/srad_v1")
!2 = !{}
!3 = !{!4, !5, !6, !68, !69, !70, !82, !86, !87, !91}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !DISubprogram(name: "fclose", scope: !7, file: !7, line: 213, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!7 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!8 = !DISubroutineType(types: !9)
!9 = !{!5, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !12, line: 49, size: 1728, elements: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!13 = !{!14, !15, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !31, !32, !33, !34, !38, !40, !42, !46, !49, !51, !54, !57, !58, !59, !63, !64}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !11, file: !12, line: 51, baseType: !5, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !11, file: !12, line: 54, baseType: !16, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !11, file: !12, line: 55, baseType: !16, size: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !11, file: !12, line: 56, baseType: !16, size: 64, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !11, file: !12, line: 57, baseType: !16, size: 64, offset: 256)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !11, file: !12, line: 58, baseType: !16, size: 64, offset: 320)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !11, file: !12, line: 59, baseType: !16, size: 64, offset: 384)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !11, file: !12, line: 60, baseType: !16, size: 64, offset: 448)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !11, file: !12, line: 61, baseType: !16, size: 64, offset: 512)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !11, file: !12, line: 64, baseType: !16, size: 64, offset: 576)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !11, file: !12, line: 65, baseType: !16, size: 64, offset: 640)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !11, file: !12, line: 66, baseType: !16, size: 64, offset: 704)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !11, file: !12, line: 68, baseType: !29, size: 64, offset: 768)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !12, line: 36, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !11, file: !12, line: 70, baseType: !10, size: 64, offset: 832)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !11, file: !12, line: 72, baseType: !5, size: 32, offset: 896)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !11, file: !12, line: 73, baseType: !5, size: 32, offset: 928)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !11, file: !12, line: 74, baseType: !35, size: 64, offset: 960)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !36, line: 152, baseType: !37)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!37 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !11, file: !12, line: 77, baseType: !39, size: 16, offset: 1024)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !11, file: !12, line: 78, baseType: !41, size: 8, offset: 1040)
!41 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !11, file: !12, line: 79, baseType: !43, size: 8, offset: 1048)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 1)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !11, file: !12, line: 81, baseType: !47, size: 64, offset: 1088)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !12, line: 43, baseType: null)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !11, file: !12, line: 89, baseType: !50, size: 64, offset: 1152)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !36, line: 153, baseType: !37)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !11, file: !12, line: 91, baseType: !52, size: 64, offset: 1216)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !12, line: 37, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !11, file: !12, line: 92, baseType: !55, size: 64, offset: 1280)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !12, line: 38, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !11, file: !12, line: 93, baseType: !10, size: 64, offset: 1344)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !11, file: !12, line: 94, baseType: !4, size: 64, offset: 1408)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !11, file: !12, line: 95, baseType: !60, size: 64, offset: 1472)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 46, baseType: !62)
!61 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!62 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !11, file: !12, line: 96, baseType: !5, size: 32, offset: 1536)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !11, file: !12, line: 98, baseType: !65, size: 160, offset: 1568)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 20)
!68 = !DISubprogram(name: "fgetc", scope: !7, file: !7, line: 485, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!69 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!70 = !DISubprogram(name: "gettimeofday", scope: !71, file: !71, line: 66, type: !72, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/time.h", directory: "")
!72 = !DISubroutineType(types: !73)
!73 = !{!5, !74, !4}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !76, line: 8, size: 128, elements: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "")
!77 = !{!78, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !75, file: !76, line: 10, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !36, line: 160, baseType: !37)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !75, file: !76, line: 11, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !36, line: 162, baseType: !37)
!82 = !DISubprogram(name: "omp_set_num_threads", scope: !83, file: !83, line: 57, type: !84, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!83 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/omp.h", directory: "")
!84 = !DISubroutineType(types: !85)
!85 = !{null, !5}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!87 = !DISubprogram(name: "free", scope: !88, file: !88, line: 565, type: !89, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!88 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!89 = !DISubroutineType(types: !90)
!90 = !{null, !4}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!92 = !{i32 7, !"Dwarf Version", i32 4}
!93 = !{i32 2, !"Debug Info Version", i32 3}
!94 = !{i32 1, !"wchar_size", i32 4}
!95 = !{!"clang version 10.0.0-4ubuntu1 "}
!96 = distinct !DISubprogram(name: "write_graphics", scope: !97, file: !97, line: 22, type: !98, scopeLine: 27, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !100)
!97 = !DIFile(filename: "./graphics.c", directory: "/mnt/d/RISC-V-PROJECT/rowan-riscv-rodinia-llvm/src/openmp/srad/srad_v1")
!98 = !DISubroutineType(types: !99)
!99 = !{null, !16, !86, !5, !5, !5, !5}
!100 = !{!101, !102, !103, !104, !105, !106, !107, !111, !112}
!101 = !DILocalVariable(name: "filename", arg: 1, scope: !96, file: !97, line: 22, type: !16)
!102 = !DILocalVariable(name: "input", arg: 2, scope: !96, file: !97, line: 23, type: !86)
!103 = !DILocalVariable(name: "data_rows", arg: 3, scope: !96, file: !97, line: 24, type: !5)
!104 = !DILocalVariable(name: "data_cols", arg: 4, scope: !96, file: !97, line: 25, type: !5)
!105 = !DILocalVariable(name: "major", arg: 5, scope: !96, file: !97, line: 26, type: !5)
!106 = !DILocalVariable(name: "data_range", arg: 6, scope: !96, file: !97, line: 27, type: !5)
!107 = !DILocalVariable(name: "fid", scope: !96, file: !97, line: 33, type: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !110, line: 7, baseType: !11)
!110 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!111 = !DILocalVariable(name: "i", scope: !96, file: !97, line: 34, type: !5)
!112 = !DILocalVariable(name: "j", scope: !96, file: !97, line: 34, type: !5)
!113 = !DILocation(line: 0, scope: !96)
!114 = !DILocation(line: 40, column: 8, scope: !96)
!115 = !DILocation(line: 41, column: 10, scope: !116)
!116 = distinct !DILexicalBlock(scope: !96, file: !97, line: 41, column: 6)
!117 = !DILocation(line: 41, column: 6, scope: !96)
!118 = !DILocation(line: 42, column: 3, scope: !119)
!119 = distinct !DILexicalBlock(scope: !116, file: !97, line: 41, column: 19)
!120 = !DILocation(line: 43, column: 3, scope: !119)
!121 = !DILocation(line: 50, column: 2, scope: !96)
!122 = !DILocation(line: 51, column: 2, scope: !96)
!123 = !DILocation(line: 52, column: 2, scope: !96)
!124 = !DILocation(line: 59, column: 10, scope: !125)
!125 = distinct !DILexicalBlock(scope: !96, file: !97, line: 59, column: 5)
!126 = !DILocation(line: 0, scope: !125)
!127 = !DILocation(line: 59, column: 5, scope: !96)
!128 = !DILocation(line: 69, column: 3, scope: !129)
!129 = distinct !DILexicalBlock(scope: !130, file: !97, line: 69, column: 3)
!130 = distinct !DILexicalBlock(scope: !125, file: !97, line: 68, column: 6)
!131 = !DILocation(line: 0, scope: !132)
!132 = distinct !DILexicalBlock(scope: !133, file: !97, line: 70, column: 4)
!133 = distinct !DILexicalBlock(scope: !134, file: !97, line: 70, column: 4)
!134 = distinct !DILexicalBlock(scope: !135, file: !97, line: 69, column: 29)
